app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE (3) LIMIT ?  [["LIMIT", 1]]
---
    def show
        @student = Student.find_by(params[:id])

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "adriana"], ["last_name", "dipietro"], ["created_at", "2021-03-05 02:19:22.650649"], ["updated_at", "2021-03-05 02:19:22.650649"]]
---
    def create
        @student = Student.new(params.require(:student).permit(:first_name, :last_name))
        #@student.first_name = params[:first_name]
        #@student.last_name = params[:last_name]
        @student.save